In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Pandas
     - Python Library
     - Pandas deals in all types of data
     - Backend Numpy
# Panda Data Structure
     - Pandas Series
     - Pandas Data Frame
### Pandas Series
     - Data in single Columns (Univariate) is series

In [3]:
# Creating series
s1 = pd.Series([23,45,67,89,34])
s1

0    23
1    45
2    67
3    89
4    34
dtype: int64

components: index , values , datatype(dtype)

In [4]:
s1.values

array([23, 45, 67, 89, 34], dtype=int64)

In [5]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
# Creating series
s1 = pd.Series([23,45,67.0,89,34])
s1

0    23.0
1    45.0
2    67.0
3    89.0
4    34.0
dtype: float64

In [7]:
s1.values

array([23., 45., 67., 89., 34.])

In [8]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
s2 = pd.Series(['Headphone','Laptop','Mobilephone','Python','Powerbank'])
s2

0      Headphone
1         Laptop
2    Mobilephone
3         Python
4      Powerbank
dtype: object

# Indexing

In [12]:
s2[3]

'Python'

In [13]:
s2[0]

'Headphone'

# Slicing

In [14]:
s2[1:4]

1         Laptop
2    Mobilephone
3         Python
dtype: object

Lables: index are default sequences (0,1,2,......) where as lables are the index provided by us.

In [15]:
fruits = pd.Series(['Apples','Mangoes','Bananas','Peaches','Cherries','Guavas','Oranges'])
fruits

0      Apples
1     Mangoes
2     Bananas
3     Peaches
4    Cherries
5      Guavas
6     Oranges
dtype: object

In [18]:
fruits = pd.Series([11,12,13,14,15,16,17] , index = ['Apples','Mangoes','Bananas','Peaches','Cherries','Guavas','Oranges'])
fruits

Apples      11
Mangoes     12
Bananas     13
Peaches     14
Cherries    15
Guavas      16
Oranges     17
dtype: int64

In [19]:
fruits['Bananas']

13

In [22]:
fruits['Apples']

11

In [24]:
fruits['Mangoes':'Guavas']

Mangoes     12
Bananas     13
Peaches     14
Cherries    15
Guavas      16
dtype: int64

In [25]:
fruits[::2]

Apples      11
Bananas     13
Cherries    15
Oranges     17
dtype: int64

In [34]:
# returns boolean series
fruits==10

Apples      False
Mangoes     False
Bananas     False
Peaches     False
Cherries    False
Guavas      False
Oranges     False
dtype: bool

In [27]:
fruits==11

Apples       True
Mangoes     False
Bananas     False
Peaches     False
Cherries    False
Guavas      False
Oranges     False
dtype: bool

In [28]:
fruits==14

Apples      False
Mangoes     False
Bananas     False
Peaches      True
Cherries    False
Guavas      False
Oranges     False
dtype: bool

# Boolean Indexing

In [31]:
# boolean array or List
abc = [True, False, False, True, True, True, False]

In [32]:
fruits[abc]

Apples      11
Peaches     14
Cherries    15
Guavas      16
dtype: int64

In [33]:
fruits[fruits>12] # Masking

Bananas     13
Peaches     14
Cherries    15
Guavas      16
Oranges     17
dtype: int64

In [43]:
fruits[(fruits>12) & (fruits<16)]

Bananas     13
Peaches     14
Cherries    15
dtype: int64

In [45]:
fruits[(fruits==12) | (fruits==16)]

Mangoes    12
Guavas     16
dtype: int64

In [46]:
fruits.shape

(7,)

In [47]:
fruits.size

7

In [48]:
fruits.ndim

1

# Pandas data frame
       - Data in more than 1 column is dataframe

In [62]:
Result = {'roll#':[1,2,3,4,5,6,7,8,9,10],
         'name':['asad','ali','atif','jamal','usman','saif','suhaib','jamil','hassan','basir'],
         'python':[78,67,89,45,34,99,90,78,34,50],
         'numpy':[45,67,56,78,98,100,34,78,9,45],
         'pandas':[56,67,45,87,45,98,33,67,89,54]}

In [63]:
result = pd.DataFrame(Result)
result

   roll#    name  python  numpy  pandas
0      1    asad      78     45      56
1      2     ali      67     67      67
2      3    atif      89     56      45
3      4   jamal      45     78      87
4      5   usman      34     98      45
5      6    saif      99    100      98
6      7  suhaib      90     34      33
7      8   jamil      78     78      67
8      9  hassan      34      9      89
9     10   basir      50     45      54

In [64]:
result = pd.DataFrame(Result)
print(result)

   roll#    name  python  numpy  pandas
0      1    asad      78     45      56
1      2     ali      67     67      67
2      3    atif      89     56      45
3      4   jamal      45     78      87
4      5   usman      34     98      45
5      6    saif      99    100      98
6      7  suhaib      90     34      33
7      8   jamil      78     78      67
8      9  hassan      34      9      89
9     10   basir      50     45      54

In [54]:
result.index

RangeIndex(start=0, stop=10, step=1)

In [55]:
result.values

array([[1, 'asad', 78, 45, 56],
       [2, 'ali', 67, 67, 67],
       [3, 'atif', 89, 56, 45],
       [4, 'jamal', 45, 78, 87],
       [5, 'usman', 34, 98, 45],
       [6, 'saif', 99, 100, 98],
       [7, 'suhaib', 90, 34, 33],
       [8, 'jamil', 78, 78, 67],
       [9, 'hassan', 34, 9, 89],
       [10, 'basir', 50, 45, 54]], dtype=object)

In [56]:
result.columns

Index(['roll#', 'name', 'python', 'numpy', 'pandas'], dtype='object')

In [57]:
type(result)

pandas.core.frame.DataFrame

In [58]:
emp = pd.read_excel("employee.xlsx")
emp

    Serial  Emp_ID Designation  Department   Age    Salary
0        1    1101     Manager    Accounts  50.0  200000.0
1        2    1107     Officer          IT  30.0   80000.0
2        3    1203     Officer          HR  28.0       NaN
3        4    1005     Manager          HR  45.0  120000.0
4        5    2123  Office Boy    Accounts  27.0   45000.0
5        6    2451  Accountant         NaN  34.0  100000.0
6        7    1111  Accountant    Accounts   NaN  110000.0
7        8    1001     Officer          IT  25.0   75000.0
8        9    1234     Manager          IT  23.0       NaN
9       10    2156    Engineer  Production  45.0   89000.0
10      11    6543     Officer  Production  29.0  100000.0
11      12    3214  Accountant     Account  49.0  123000.0
12      13    2156    Engineer  Production  45.0   89000.0
13      14    1098     Officer          IT  25.0  100000.0
14      15    2912     Officer          IT  31.0   90000.0
15      16    1222     Officer         NaN  25.0       NaN
16      17    2156    Engineer  Production  45.0   89000.0
17      18    2123  Office Boy    Accounts  27.0   45000.0

# Result Data

In [59]:
result

   roll#    name  python  numpy  pandas
0      1    asad      78     45      56
1      2     ali      67     67      67
2      3    atif      89     56      45
3      4   jamal      45     78      87
4      5   usman      34     98      45
5      6    saif      99    100      98
6      7  suhaib      90     34      33
7      8   jamil      78     78      67
8      9  hassan      34      9      89
9     10   basir      50     45      54

# Columns
    - Accessing a column
    - Accessing more than 1 clm
    - del a clm
    - add a clm

In [68]:
result.shape

(10, 5)

In [61]:
result.ndim

2

In [65]:
type(result['name'])

pandas.core.series.Series

# Accessing a column

In [66]:
result['name']

0      asad
1       ali
2      atif
3     jamal
4     usman
5      saif
6    suhaib
7     jamil
8    hassan
9     basir
Name: name, dtype: object

In [67]:
result.name

0      asad
1       ali
2      atif
3     jamal
4     usman
5      saif
6    suhaib
7     jamil
8    hassan
9     basir
Name: name, dtype: object

In [69]:
result.python

0    78
1    67
2    89
3    45
4    34
5    99
6    90
7    78
8    34
9    50
Name: python, dtype: int64

### Accesing more than 1 column

In [70]:
result[['name','python']]

     name  python
0    asad      78
1     ali      67
2    atif      89
3   jamal      45
4   usman      34
5    saif      99
6  suhaib      90
7   jamil      78
8  hassan      34
9   basir      50

In [71]:
result[['name','numpy','python']]

     name  numpy  python
0    asad     45      78
1     ali     67      67
2    atif     56      89
3   jamal     78      45
4   usman     98      34
5    saif    100      99
6  suhaib     34      90
7   jamil     78      78
8  hassan      9      34
9   basir     45      50

# Adding more columns in data
            - Broadcasting a value to all records
            - Generate data from data
                    - conditional

result['total'] = result.python + result.pandas + result.numpy
result

In [ ]:
result['Percentage'] = 
result

In [79]:
result['status'] = ["Pass" if marks >= 225 else "Fail" for marks in result.total]
result

   roll#    name  python  numpy  pandas  total status
0      1    asad      78     45      56    179   Fail
1      2     ali      67     67      67    201   Fail
2      3    atif      89     56      45    190   Fail
3      4   jamal      45     78      87    210   Fail
4      5   usman      34     98      45    177   Fail
5      6    saif      99    100      98    297   Pass
6      7  suhaib      90     34      33    157   Fail
7      8   jamil      78     78      67    223   Fail
8      9  hassan      34      9      89    132   Fail
9     10   basir      50     45      54    149   Fail